#+TITLE: September 30, 2019 - October 12, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-09-30 Mon>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-sandeepk: 1.84
  :END:
** akshay196
*** Mastering Python Design Patterns - Part I [0/13]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1569864940
    :TASKID: READ.1569864940
    :END:
    Second Edition. by Sakis Kasampalis, Kamon Ayeva.
    https://learning.oreilly.com/library/view/mastering-python-design/9781788837484/
    - [ ] The factory method                               (1h)
    - [ ] The abstract factory                             (1h)
    - [ ] The Builder Pattern                              (1h)
    - [ ] The prototype pattern                            (1h)
    - [ ] Singleton                                        (1h)
    - [ ] The Adapter Pattern                              (1h)
    - [ ] The Decorator Pattern                            (1h)
    - [ ] The Bridge Pattern                               (1h)
    - [ ] The Facade Pattern                               (1h)
    - [ ] The flyweight pattern                            (1h)
    - [ ] The model-view-controller pattern                (1h)
    - [ ] The proxy pattern                                (1h)
    - [ ] The Chain of Responsibility Pattern              (1h)
** bhavin192
*** Write blog post about Rootconf Pune 2019
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1570037533
    :TASKID:   WRITE.1570037533
    :END:
*** Attend PyCon India 2019
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       EVENT.1570037556
    :TASKID:   EVENT.1570037556
    :END:
** sandeepk
*** DONE 2PI Research [Slack Bot] [2/2]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:   4.17
    :OWNER: sandeepk
    :ID: READ.1569958301
    :TASKID: READ.1569958301
    :END:
    :LOGBOOK:
    CLOCK: [2019-10-08 Tue 16:00]--[2019-10-08 Tue 17:40] =>  1:40
    CLOCK: [2019-10-06 Sun 17:00]--[2019-10-06 Sun 18:20] =>  1:20
    CLOCK: [2019-10-04 Fri 22:20]--[2019-10-04 Fri 23:30] =>  1:10
    :END:
    - [X] https://api.slack.com/tutorials/tags/python                             (4h)
    - [X] https://www.fullstackpython.com/blog/build-first-slack-bot-python.html  (3h)
*** DONE [#B] Dive into Python3 [2/2]
    :PROPERTIES:
    :ESTIMATED: 7 
    :ACTUAL:   6.08
    :OWNER: sandeepk
    :ID: READ.1559639223
    :TASKID: READ.1559639223
    :END:
    :LOGBOOK:
    CLOCK: [2019-10-12 Sat 22:10]--[2019-10-12 Sat 23:50] =>  1:40
    CLOCK: [2019-10-10 Thu 23:10]--[2019-10-11 Fri 00:30] =>  1:20
    CLOCK: [2019-10-09 Wed 20:40]--[2019-10-09 Wed 21:55] =>  1:15
    CLOCK: [2019-10-02 Wed 22:40]--[2019-10-02 Wed 23:30] =>  0:50
    CLOCK: [2019-10-01 Tue 22:00]--[2019-10-01 Tue 23:00] =>  1:00
    :END:
    - [X] Serializing Python Objects              (3h)
    - [X] HTTP Web Services                       (4h)


